Revit 2027 API
ExportFontTable.GetFontTableIterator Method
Returns a FontTableIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportFontTableIterator GetFontTableIterator()
Public Function GetFontTableIterator As ExportFontTableIterator
public:
ExportFontTableIterator^ GetFontTableIterator()
member GetFontTableIterator : unit -> ExportFontTableIterator
Return Value
ExportFontTableIterator
A FontTableIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
ExportFontTable Class
Autodesk.Revit.DB Namespace